index.org
#+TITLE: Formula Parser
#+AUTHOR: Peter W Moresi
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://orgmode.org/worg/style/worg.css" />

JavaScript parser for spreadsheet formula to geneate abstract syntax tree (AST).

#+BEGIN_SRC js
  var parser = require('formula-ast');
  parser.parse('IF(TRUE, "It works", "It is broke")');
#+END_SRC

* Usage

  For the brower:

  #+BEGIN_SRC html
  <script src="dist/formulaParser.js"></script>
  #+END_SRC

  #+BEGIN_SRC js
    parser.parse('IF(TRUE, "Yes", "No")');
  #+END_SRC

  If you use node, webpack or browserify:

  #+BEGIN_SRC sh
    npm install formula-ast
  #+END_SRC

  #+BEGIN_SRC js
    var parser = require('formula-ast);
    parser.parse('IF(TRUE, "Yes", "No")');
  #+END_SRC

* Syntax
  
  The formulas use the same syntax and functions found in most spreadsheet software. 

** Technical Notes						   :noexport:

  Under the covers the formulas are compiled to JavaScript which depend on functions loaded
  on the page. The library looks for functions in the workbook.fn namespace and if not found then
  in the root object (e.g. window).
  
** Constants
   
   - TRUE
   - FALSE
     
** Prefix Operators
   
   A prefix operator is immediately to the left of the operand.
   
   |----------+--------------+---------------------------------------------------------------+--------------|
   | operator | Token Name   | Operation Performed                                           | Supported    |
   |----------+--------------+---------------------------------------------------------------+--------------|
   | -        | prefix-minus | Negates operand; converts positive to negative and vice versa | Yes          |
   | +        | prefix-plus  | Converts operand to number                                    | Yes          |
   | $        |              | Next component of an A1 reference is absolute                 | No / Ignores |
   |----------+--------------+---------------------------------------------------------------+--------------|
   
** Inflix Operators
   
   An inflix operator is between two operands. The operands are called the rhs and lhs for right hand side and left hand side, respectively.
   
   |----------+----------------+-----------------------------------+-----------|
   | Operator | Token Name     | Operation Performed               | Supported |
   |----------+----------------+-----------------------------------+-----------|
   | +        | infix-plus     | addition                          | Yes       |
   | -        | infix-minus    | subtraction                       | Yes       |
   | *        | infix-multiply | multiplication                    | Yes       |
   | ^        | infix-power    | exponentiation                    | Yes       |
   | =        | infix-eq       | is equal to                       | Yes       |
   | <>       | infix-ne       | is not equal to                   | Yes       |
   | >        | infix-gt       | is greater than                   | Yes       |
   | <        | infix-lt       | is less than                      | Yes       |
   | >=       | infix-gte      | is greater than or equal to       | Yes       |
   | <=       | infix-lte      | is less than or equal to          | Yes       |
   | &        | infix-concat   | concatentation of strings         | Yes       |
   | \w       |                | reference intersection            | No        |
   | ,        |                | reference union                   | Yes       |
   | :        |                | reference range                   | Yes       |
   | !        |                | separate worksheet from reference | Yes       |
   |----------+----------------+-----------------------------------+-----------|
   
** Postfix Operators
   
   A postfix operator is immediate to the right side of the operand.
   
   |----------+------------------------+-----------|
   | Operator | Operation              | Supported |
   |----------+------------------------+-----------|
   | %        | Divides operand by 100 | Yes       |
   |----------+------------------------+-----------|
   
** Matchfix Operators
   
   A matchfix operator specifies the start and end of a logical grouping.
   
   |-----------+------+-------+-----------------------------------------------------------------|
   | Supported | left | right | Operation                                                       |
   |-----------+------+-------+-----------------------------------------------------------------|
   | Yes       | "    | "     | string constant                                                 |
   | Yes       | {    | }     | array constant                                                  |
   | Yes       | (    | )     | arithmetic grouping or function arguments or reference grouping |
   | Yes       | '    | '     | grouping worksheet name                                         |
   | No        | [    | ]     | grouping workbook name (external reference)                     |
   | No        | [    | ]     | Relative reference in R1C1 style                                |
   |-----------+------+-------+-----------------------------------------------------------------|
   
