index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Formula Parser</title>
<!-- 2015-09-12 Sat 21:30 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Peter W Moresi" />
<link rel="stylesheet" type="text/css" href="http://orgmode.org/worg/style/worg.css" />
</head>
<body>
<div id="content">
<h1 class="title">Formula Parser</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Usage</a></li>
<li><a href="#sec-2">2. Syntax</a>
<ul>
<li><a href="#sec-2-1">2.1. Constants</a></li>
<li><a href="#sec-2-2">2.2. Prefix Operators</a></li>
<li><a href="#sec-2-3">2.3. Inflix Operators</a></li>
<li><a href="#sec-2-4">2.4. Postfix Operators</a></li>
<li><a href="#sec-2-5">2.5. Matchfix Operators</a></li>
<li><a href="#sec-2-6">2.6. Operator Precedence</a></li>
<li><a href="#sec-2-7">2.7. Change Order with Grouping</a></li>
<li><a href="#sec-2-8">2.8. Calculation Errors</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Node Types / Subtypes</a></li>
<li><a href="#sec-4">4. Formula Grammar</a></li>
</ul>
</div>
</div>
<p>
JavaScript parser for spreadsheet formula to geneate abstract syntax tree (AST).
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">parser</span> = require(<span style="color: #008000;">'formula-ast'</span>);
parser.parse(<span style="color: #008000;">'IF(TRUE, "It works", "It is broke")'</span>);
</pre>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Usage</h2>
<div class="outline-text-2" id="text-1">
<p>
For the brower:
</p>

<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #006699;">script</span> <span style="color: #BA36A5;">src</span>=<span style="color: #008000;">"dist/formulaParser.js"</span>&gt;&lt;/<span style="color: #006699;">script</span>&gt;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-js">parser.parse(<span style="color: #008000;">'IF(TRUE, "Yes", "No")'</span>);
</pre>
</div>

<p>
If you use node, webpack or browserify:
</p>

<div class="org-src-container">

<pre class="src src-sh">npm install formula-ast
</pre>
</div>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">parser</span> = require(<span style="color: #008000;">'formula-ast);</span>
<span style="color: #008000;">parser.parse('</span>IF(TRUE, <span style="color: #008000;">"Yes"</span>, <span style="color: #008000;">"No"</span>)<span style="color: #008000;">');</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Syntax</h2>
<div class="outline-text-2" id="text-2">
<p>
The formulas use the same syntax and functions found in most spreadsheet software. 
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Constants</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>TRUE
</li>
<li>FALSE
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Prefix Operators</h3>
<div class="outline-text-3" id="text-2-2">
<p>
A prefix operator is immediately to the left of the operand.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">operator</th>
<th scope="col" class="left">Token Name</th>
<th scope="col" class="left">Operation Performed</th>
<th scope="col" class="left">Supported</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">-</td>
<td class="left">prefix-minus</td>
<td class="left">Negates operand; converts positive to negative and vice versa</td>
<td class="left">Yes</td>
</tr>

<tr>
<td class="left">+</td>
<td class="left">prefix-plus</td>
<td class="left">Converts operand to number</td>
<td class="left">Yes</td>
</tr>

<tr>
<td class="left">$</td>
<td class="left">&#xa0;</td>
<td class="left">Next component of an A1 reference is absolute</td>
<td class="left">No / Ignores</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Inflix Operators</h3>
<div class="outline-text-3" id="text-2-3">
<p>
An inflix operator is between two operands. The operands are called the rhs and lhs for right hand side and left hand side, respectively.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Operator</th>
<th scope="col" class="left">Token Name</th>
<th scope="col" class="left">Operation Performed</th>
<th scope="col" class="left">Supported</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">+</td>
<td class="left">infix-plus</td>
<td class="left">addition</td>
<td class="left">Yes</td>
</tr>

<tr>
<td class="left">-</td>
<td class="left">infix-minus</td>
<td class="left">subtraction</td>
<td class="left">Yes</td>
</tr>

<tr>
<td class="left">*</td>
<td class="left">infix-multiply</td>
<td class="left">multiplication</td>
<td class="left">Yes</td>
</tr>

<tr>
<td class="left">^</td>
<td class="left">infix-power</td>
<td class="left">exponentiation</td>
<td class="left">Yes</td>
</tr>

<tr>
<td class="left">=</td>
<td class="left">infix-eq</td>
<td class="left">is equal to</td>
<td class="left">Yes</td>
</tr>

<tr>
<td class="left">&lt;&gt;</td>
<td class="left">infix-ne</td>
<td class="left">is not equal to</td>
<td class="left">Yes</td>
</tr>

<tr>
<td class="left">&gt;</td>
<td class="left">infix-gt</td>
<td class="left">is greater than</td>
<td class="left">Yes</td>
</tr>

<tr>
<td class="left">&lt;</td>
<td class="left">infix-lt</td>
<td class="left">is less than</td>
<td class="left">Yes</td>
</tr>

<tr>
<td class="left">&gt;=</td>
<td class="left">infix-gte</td>
<td class="left">is greater than or equal to</td>
<td class="left">Yes</td>
</tr>

<tr>
<td class="left">&lt;=</td>
<td class="left">infix-lte</td>
<td class="left">is less than or equal to</td>
<td class="left">Yes</td>
</tr>

<tr>
<td class="left">&amp;</td>
<td class="left">infix-concat</td>
<td class="left">concatentation of strings</td>
<td class="left">Yes</td>
</tr>

<tr>
<td class="left">\w</td>
<td class="left">&#xa0;</td>
<td class="left">reference intersection</td>
<td class="left">No</td>
</tr>

<tr>
<td class="left">,</td>
<td class="left">&#xa0;</td>
<td class="left">reference union</td>
<td class="left">Yes</td>
</tr>

<tr>
<td class="left">:</td>
<td class="left">&#xa0;</td>
<td class="left">reference range</td>
<td class="left">Yes</td>
</tr>

<tr>
<td class="left">!</td>
<td class="left">&#xa0;</td>
<td class="left">separate worksheet from reference</td>
<td class="left">Yes</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Postfix Operators</h3>
<div class="outline-text-3" id="text-2-4">
<p>
A postfix operator is immediate to the right side of the operand.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Operator</th>
<th scope="col" class="left">Operation</th>
<th scope="col" class="left">Supported</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">%</td>
<td class="left">Divides operand by 100</td>
<td class="left">Yes</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Matchfix Operators</h3>
<div class="outline-text-3" id="text-2-5">
<p>
A matchfix operator specifies the start and end of a logical grouping.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Supported</th>
<th scope="col" class="left">left</th>
<th scope="col" class="left">right</th>
<th scope="col" class="left">Operation</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Yes</td>
<td class="left">"</td>
<td class="left">"</td>
<td class="left">string constant</td>
</tr>

<tr>
<td class="left">Yes</td>
<td class="left">{</td>
<td class="left">}</td>
<td class="left">array constant</td>
</tr>

<tr>
<td class="left">Yes</td>
<td class="left">(</td>
<td class="left">)</td>
<td class="left">arithmetic grouping or function arguments or reference grouping</td>
</tr>

<tr>
<td class="left">Yes</td>
<td class="left">'</td>
<td class="left">'</td>
<td class="left">grouping worksheet name</td>
</tr>

<tr>
<td class="left">No</td>
<td class="left">[</td>
<td class="left">]</td>
<td class="left">grouping workbook name (external reference)</td>
</tr>

<tr>
<td class="left">No</td>
<td class="left">[</td>
<td class="left">]</td>
<td class="left">Relative reference in R1C1 style</td>
</tr>
</tbody>
</table>
</div>
</div>
