index.org
** Operator Precedence
   
   If you combine several different operators into the same formula then the operations
   are based on the precedence of each operator.
   
   This table describe the order in which the operation are performed with the operations
   performed first on the top.
   
   |-------------------------------+---------------------|
   | Operator                      | Description         |
   |-------------------------------+---------------------|
   | -                             | Negation (as in –1) |
   | %                             | Percent             |
   | ^                             | Power Function      |
   | * and /                       | Multiply and Divide |
   | + and -                       | Add and Subtract    |
   | &                             | Combine two strings |
   | < and > and <=  and >= and <> | Comparision         |
   |-------------------------------+---------------------|
   
** Change Order with Grouping
   
   Parentheses can be used to change the order in which operation are performed. For example,
   the formula below results in 15. 5*2 is multipled to result in 10. The result is then added
   to 5.
   
   #+BEGIN_EXAMPLE
     =5+5*2
   #+END_EXAMPLE
   
   To override the default order you can group together expression. For example below the formula
   results in 20 because 5+5 is added together and multipled by 2.
   
   #+BEGIN_EXAMPLE
     =(5+5)*2   
   #+END_EXAMPLE

** Calculation Errors

   The calculation errors categorize problem found in formulas.

   The errors supported by the system are:
   
   #+NAME: ErrorTypes
   |---------+---------------|
   | code    | text          |
   |---------+---------------|
   | nil     | #NULL!        |
   | div0    | #DIV/0!       |
   | value   | #VALUE?       |
   | ref     | #REF!         |
   | name    | #NAME?        |
   | num     | @NUM!         |
   | na      | #N/A          |
   | error   | #ERROR!       |
   | data    | #GETTING_DATA |
   | missing | #MISSING      |
   | unknown | #UNKNOWN      |
   |---------+---------------|

   #+NAME: CalcErrors
   #+Begin_src js :exports none
     // Define the error system
     var error = {};

     function CalcError(message) {
         this.message = message;
     }

     CalcError.prototype = new Error; 

     CalcError.prototype.toString = function() {
         return this.message;
     }

     error.nil = new CalcError('#NULL!');
     error.div0 = new CalcError('#DIV/0!');
     error.value = new CalcError('#VALUE?');
     error.ref = new CalcError('#REF!');
     error.name = new CalcError('#NAME?');
     error.num = new CalcError('#NUM!');
     error.na = new CalcError('#N/A');
     error.error = new CalcError('#ERROR!');
     error.data = new CalcError('#GETTING_DATA');
     error.missing = new CalcError('#MISSING');
     error.unknown = new CalcError('#UNKNOWN');

   #+END_SRC
    
* Node Types / Subtypes
  
  1. value
     1. boolean
     2. number
     3. string
     4. variable
     5. array
  2. cell
     1. local
     2. remote
     3. remote-named
  3. operator
     1. infix-add
     2. infix-concat
     3. infix-divide
     4. infix-gt
     5. infix-gte
     6. infix-multiply
     7. infix-ne
     8. infix-eq
     9. infix-lt
     10. infix-lte
     11. infix-power
     12. infix-subtract
     13. prefix-plus
     14. prefix-minus
  4. function
  5. group
  6. range
  7. cell
     1. local
     2. remote

