index.html

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Operator Precedence</h3>
<div class="outline-text-3" id="text-2-6">
<p>
If you combine several different operators into the same formula then the operations
are based on the precedence of each operator.
</p>

<p>
This table describe the order in which the operation are performed with the operations
performed first on the top.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Operator</th>
<th scope="col" class="left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">-</td>
<td class="left">Negation (as in –1)</td>
</tr>

<tr>
<td class="left">%</td>
<td class="left">Percent</td>
</tr>

<tr>
<td class="left">^</td>
<td class="left">Power Function</td>
</tr>

<tr>
<td class="left">* and /</td>
<td class="left">Multiply and Divide</td>
</tr>

<tr>
<td class="left">+ and -</td>
<td class="left">Add and Subtract</td>
</tr>

<tr>
<td class="left">&amp;</td>
<td class="left">Combine two strings</td>
</tr>

<tr>
<td class="left">&lt; and &gt; and &lt;=  and &gt;= and &lt;&gt;</td>
<td class="left">Comparision</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> Change Order with Grouping</h3>
<div class="outline-text-3" id="text-2-7">
<p>
Parentheses can be used to change the order in which operation are performed. For example,
the formula below results in 15. 5*2 is multipled to result in 10. The result is then added
to 5.
</p>

<pre class="example">
=5+5*2
</pre>

<p>
To override the default order you can group together expression. For example below the formula
results in 20 because 5+5 is added together and multipled by 2.
</p>

<pre class="example">
=(5+5)*2
</pre>
</div>
</div>

<div id="outline-container-sec-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> Calculation Errors</h3>
<div class="outline-text-3" id="text-2-8">
<p>
The calculation errors categorize problem found in formulas.
</p>

<p>
The errors supported by the system are:
</p>

<table id="ErrorTypes" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">code</th>
<th scope="col" class="left">text</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">nil</td>
<td class="left">#NULL!</td>
</tr>

<tr>
<td class="left">div0</td>
<td class="left">#DIV/0!</td>
</tr>

<tr>
<td class="left">value</td>
<td class="left">#VALUE?</td>
</tr>

<tr>
<td class="left">ref</td>
<td class="left">#REF!</td>
</tr>

<tr>
<td class="left">name</td>
<td class="left">#NAME?</td>
</tr>

<tr>
<td class="left">num</td>
<td class="left">@NUM!</td>
</tr>

<tr>
<td class="left">na</td>
<td class="left">#N/A</td>
</tr>

<tr>
<td class="left">error</td>
<td class="left">#ERROR!</td>
</tr>

<tr>
<td class="left">data</td>
<td class="left">#GETTING<sub>DATA</sub></td>
</tr>

<tr>
<td class="left">missing</td>
<td class="left">#MISSING</td>
</tr>

<tr>
<td class="left">unknown</td>
<td class="left">#UNKNOWN</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Node Types / Subtypes</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>value
<ol class="org-ol">
<li>boolean
</li>
<li>number
</li>
<li>string
</li>
<li>variable
</li>
<li>array
</li>
</ol>
</li>
<li>cell
<ol class="org-ol">
<li>local
</li>
<li>remote
</li>
<li>remote-named
</li>
</ol>
</li>
<li>operator
<ol class="org-ol">
<li>infix-add
</li>
<li>infix-concat
</li>
<li>infix-divide
</li>
<li>infix-gt
</li>
<li>infix-gte
</li>
<li>infix-multiply
</li>
<li>infix-ne
</li>
<li>infix-eq
</li>
<li>infix-lt
</li>
<li>infix-lte
</li>
<li>infix-power
</li>
<li>infix-subtract
</li>
<li>prefix-plus
</li>
<li>prefix-minus
</li>
</ol>
</li>
<li>function
</li>
<li>group
</li>
<li>range
</li>
<li>cell
<ol class="org-ol">
<li>local
</li>
<li>remote
</li>
</ol>
</li>
</ol>
</div>
</div>
