index.html

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Formula Grammar</h2>
<div class="outline-text-2" id="text-4">
<p>
The grammar is BNF compile by <a href="http://zaach.github.io/jison/">jison</a> into the parser.
</p>

<div class="org-src-container">

<pre class="src src-jison">/* description: Parses end executes spreadsheet formula expressions. */

/* lexical grammar */
%lex

alpha                       [a-zA-Z]
digit                       [0-9]
esc                         "\""
int                         "-"?(?:[0-9]|[1-9][0-9]+)
exp                         (?:[eE][-+]?[0-9]+)
frac                        (?:\.[0-9]+)

%%

\s+                   /* skip whitespace */
[0-9]+("."[0-9]+)?\b  return 'NUMBER'
"TRUE"                return 'TRUE'
"FALSE"               return 'FALSE'
"*"                   return '*'
"/"                   return '/'
"-"                   return '-'
"+"                   return '+'
"&amp;"                   return '&amp;'
"^"                   return '^'
"("                   return '('
")"                   return ')'
"&gt;="                  return "&gt;="
"&lt;="                  return "&lt;="
"&lt;&gt;"                  return "&lt;&gt;"
"="                   return "="
"&gt;"                   return "&gt;"
"&lt;"                   return "&lt;"
"{"                   return "{"
"}"                   return "}"
"!"                   return "!"
","                   return ","
":"                   return ":"
";"                   return ";"
"%"                   return "%"
[A-Za-z](?=[(])                    {return 'FUNC';}
[A-Za-z][A-Za-z0-9\.]+(?=[(])                    {return 'FUNC';}
\$\'(?:\'\'|[^'])*\'\!    yytext = yytext.substr(2,yyleng-3).replace(/\"\"/g, "\""); return "SHEET";
\'(?:\'\'|[^'])*\'\!    yytext = yytext.substr(1,yyleng-3).replace(/\"\"/g, "\""); return "SHEET";
[a-zA-Z]([a-zA-Z0-9.$]+)?\!  yytext = yytext.slice(0, -1); return "SHEET"
\$([a-zA-Z])([a-zA-Z0-9.$]+)?\!  yytext = yytext.slice(1, -1); return "SHEET"
\$?([a-zA-Z]+)\$?([0-9]+)                              return "CELL";
\"(?:\"\"|[^"])*\"    yytext = yytext.substr(1,yyleng-2).replace(/\"\"/g, "\""); return "STRING";
[a-zA-Z]([a-zA-Z0-9.$^\(]+)?  return 'IDENT'
&lt;&lt;EOF&gt;&gt;               return 'EOF'
.                     return 'INVALID'

/lex

/* operator associations and precedence */
%left '=' '&gt;=' '&lt;=' '&gt;' '&lt;' '&lt;&gt;'
%left '&amp;'
%left '+' '-'
%left '*' '/'
%left '^'
%left ':'
%left UMINUS

%right '%'


%start expressions

%% /* language grammar */

expressions
: e EOF
    { return $1; }
| '=' e EOF
    { return $2; }
;

  e          
: e '+' e
    {$$ = { type: "operator", subtype: 'infix-add', operands:[$1, $3]}; }
| e '-' e
    {$$ = { type: "operator", subtype: 'infix-subtract', operands:[$1, $3]}; }
| e '*' e
    {$$ = { type: "operator", subtype: 'infix-multiply', operands:[$1, $3]}; }
| e '/' e
    {$$ = { type: "operator", subtype: 'infix-divide', operands:[$1, $3] }; }
| e '^' e
    {$$ = { type: "operator", subtype: 'infix-power', operands:[$1, $3] }; }
| e '&lt;&gt;' e
    {$$ = { type: "operator", subtype: 'infix-ne', operands:[$1, $3] }; }
| e '=' e
    {$$ = { type: "operator", subtype: 'infix-eq', operands:[$1, $3] }; }
| e '&gt;' e
    {$$ = { type: "operator", subtype: 'infix-gt', operands:[$1, $3] }; }
| e '&lt;' e
    {$$ = { type: "operator", subtype: 'infix-lt', operands:[$1, $3] }; }
| e '&gt;=' e
    {$$ = { type: "operator", subtype: 'infix-gte', operands:[$1, $3] }; }
| e '&lt;=' e
    {$$ = { type: "operator", subtype: 'infix-lte', operands:[$1, $3] }; }
      | '+' e
    {$$ = { type: "operator", subtype: 'prefix-plus', operands:[$2] }; }
| e '&amp;' e
    {$$ = { type: "operator", subtype: 'infix-concat', operands:[$1, $3] }; }
| func '&amp;' e
    {$$ = { type: "operator", subtype: 'infix-concat', operands:[$1, $3] }; } 
| '-' e %prec UMINUS
    {$$ = { type: "operator", subtype: 'prefix-minus', operands:[$2] }; }
| '(' e ')'
    {$$ = { type: 'group', exp:$2 }; }
| e ':' e
    {$$ = { type: 'range', subtype: 'local', topLeft:$1, bottomRight:$3 }; }
| CELL
    {$$ = { type: 'cell', subtype: 'local', addr:$1 }; }
| SHEET CELL
    { $$ = { type: 'cell', subtype: 'remote', worksheet: $1, addr:$2 }; }
| IDENT
    { $$ = { type: 'value', subtype: 'variable', value:$1 }; }
| SHEET IDENT
    { $$ = { type: 'cell', subtype: 'remote-named', worksheet: $1, addr:$2 }; }
| func
    { $$ = $1; }
| array_literal
    { $$ = $1; }         
| TRUE
    {$$ = { type: 'value', subtype: 'boolean', value: true }; }
| FALSE
    {$$ = { type: 'value', subtype: 'boolean', value: false }; }
| STRING
    {$$ = { type: 'value', subtype: 'string', value:String(yytext)}; }
| NUMBER '%'
    {$$ = { type: 'value', subtype: 'number', value:$1/100 }; }
      | NUMBER
    {$$ = { type: 'value', subtype: 'number', value:Number(yytext) }; }
;


range
   : e ':' e
   ;

  param_list
:  e
    { $$ = [$1]; }
| param_list ',' e
    { $$ = $1.concat([$3]); } 
| param_list ';' param_list
    { $$ = ($3[0].subtype !== 'array') ? [{ type: 'value', subtype: 'array', items:$1 }, { type: 'value', subtype: 'array', items:$3 }] : [{ type: 'value', subtype: 'array', items:$1 }].concat($3); } 
;

  func
      : FUNC '(' param_list ')'
    { $$ = { type: 'function', name: $1, args:$3 }; }
| FUNC '(' ')'
    { $$ = { type: 'function', name: $1, args:[] }; }
;

  array_literal
: '{' param_list '}'
    { $$ = { type: 'value', subtype: 'array', items:$2 }; }
;
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Peter W Moresi</p>
<p class="date">Created: 2015-09-12 Sat 21:30</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.4 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
